from aiogram import types
from main import dp, bot

# gif_file_id = 'CgACAgIAAxkBAAO_ZWwfNJY7S4-qkeziYRmngWKUqgwAAhkzAAKYQmFLgGVcrZ7UZ3AzBA'
# company_info = """
#     Информация о компании:
#     Сеть ресторанов быстрого обслуживания EVOS® не стоит на месте, а постоянно растет и развивается вместе с вами и для вас!
#     Мы расширяем свою географию и открываем новые филиалы практически каждый месяц.
#     Сейчас в нашей сети насчитывается более 50 филиалов по всему Узбекистану. Поэтому мы всегда в поиске динамичных и
#     активных людей, которые хотят стать частью нашей команды и готовы строить свою карьеру в EVOS®.
#     EVOS® – это надежный бренд, которому доверяют. Работа в EVOS® – гарантия стабильного заработка и перспективы карьерного
#     роста.
#     Начни свою карьеру в EVOS® уже сейчас!
#     """
#
#     @dp.message_handler(text="🏢 О компании")
#     async def about_comp_handler(message: types.Message):
#         await bot.send_animation(message.from_user.id, gif_file_id, caption=company_info)
